// . - любой символ
// [] - любой из помещенных символов, диапазаны
// $ - конец строки
// ^ - начало строки
// [^b] - стрелка вверх внтури квадратных скобок означает отрицание
// \ - экранирование
// \d - означает любую единичную цифру
// \D - все, что угодно, кроме цифр
// \s - находит пробелы
// \S - все, кроме пробелов
// \w - буква
// \W - все, кроме букв
// \b - граница слова
// \B - все, кроме границ слова
//Квантификация
// n{4} - символ n повторяется 4 раза
// n{4,6} - символ n повторяется от 4 до 6 раз
// * - от нуля и больше
// + - от 1 и выше
// ? - или 0 или 1 раз